Revit 2027 API
BuiltInFailures.RebarSystemFailures.AreaReinforcementRegenFail Property
 Can't regenerate Area Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaReinforcementRegenFail { get; }
Public Shared ReadOnly Property AreaReinforcementRegenFail As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaReinforcementRegenFail {
	FailureDefinitionId^ get ();
}
static member AreaReinforcementRegenFail : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace